{"postId":2322892,"headline":"Welcome! Welcome, new galaxy!","publishedAt":"2023-08-02T18:43:00.102Z","state":1,"cws":[],"tags":["The Cohost Global Feed","space","astronomy","astrophotography","andromeda","galaxy","photos","photography"],"blocks":[{"type":"attachment","attachment":{"kind":"image","fileURL":"https://staging.cohostcdn.org/attachment/68d7d1e1-ca0e-40cc-bdd2-e7bef4dd072c/2023-9-2-Andromeda_hicontrast_smol.png","previewURL":"https://staging.cohostcdn.org/attachment/68d7d1e1-ca0e-40cc-bdd2-e7bef4dd072c/2023-9-2-Andromeda_hicontrast_smol.png","attachmentId":"68d7d1e1-ca0e-40cc-bdd2-e7bef4dd072c","altText":"","width":1462,"height":823}},{"type":"markdown","markdown":{"content":"I got the Andromeda galaxy!!!"}},{"type":"markdown","markdown":{"content":"Aiming the telescope was a nightmare. \"I'll use a star app to aim!\" I thought. I tried downloading Stellarium, it complained about a Google Play error. I downloaded SkEye, and it had some weird gyro issues because it expected the phone to be pointing in the same direction as the telescope, but I use my phone camera to take pics so it was mounted sideways looking at the telescope's eyepiece. I didn't really know my constellations, so it was hard to figure out what stars I could see in the light polluted sky were which stars on the app, and the part of the sky where it was seemed perfectly dark with no landmarks to aim at. I ended up pointing my telescope at a bright star, aiming upwards to what I thought was the right altitude using my mount v3's degree markers, then rotating left/right at random patches of dark sky, shooting some four second long exposures, and hoping it would appear out of the gloom."}},{"type":"markdown","markdown":{"content":"And somehow, looking through my pictures, I got it."}},{"type":"markdown","markdown":{"content":"And then I immediately lost the telescope's aim trying to see Andromeda with my eye and despite like 10 tries never managed to find it again. "}},{"type":"markdown","markdown":{"content":"I tried stacking my 3 exposures in Krita in Addition mode, but it didn't seem to work well, so you're looking at the best 4s exposure lightly edited to increase contrast."}}],"pinned":false,"commentsLocked":false,"sharesLocked":false,"singlePostPageUrl":"https://cohost.org/hillexed/post/2322892-welcome-welcome-ne"}