{"postId":2127715,"headline":"Gas giants, wooden wobbles","publishedAt":"2023-07-20T17:07:03.165Z","state":1,"cws":[],"tags":["space","astrophotography","astronomy","The Cohost Global Feed"],"blocks":[{"type":"attachment","attachment":{"kind":"image","fileURL":"https://staging.cohostcdn.org/attachment/344707f0-cf22-4022-bb9e-fd2d4fd28e86/overprocessed.png","previewURL":"https://staging.cohostcdn.org/attachment/344707f0-cf22-4022-bb9e-fd2d4fd28e86/overprocessed.png","attachmentId":"344707f0-cf22-4022-bb9e-fd2d4fd28e86","altText":"Jupiter, with my first attempt at using post-processing software. It's a big blurry blob, but now with BARELY VISIBLE STRIPES","width":448,"height":448}},{"type":"attachment","attachment":{"kind":"image","fileURL":"https://staging.cohostcdn.org/attachment/801a66e4-2f50-4db0-81a8-decebb39cb4b/jupiter2.png","previewURL":"https://staging.cohostcdn.org/attachment/801a66e4-2f50-4db0-81a8-decebb39cb4b/jupiter2.png","attachmentId":"801a66e4-2f50-4db0-81a8-decebb39cb4b","altText":"Jupiter raw through my telescope.","width":285,"height":391}},{"type":"attachment","attachment":{"kind":"image","fileURL":"https://staging.cohostcdn.org/attachment/74d46a80-fc32-4fc5-a836-0da070759cb8/saturnblur_drawnon.png","previewURL":"https://staging.cohostcdn.org/attachment/74d46a80-fc32-4fc5-a836-0da070759cb8/saturnblur_drawnon.png","attachmentId":"74d46a80-fc32-4fc5-a836-0da070759cb8","altText":"Saturn raw through my telescope. It seems weirdly smeared","width":280,"height":262}},{"type":"markdown","markdown":{"content":"I took my new wooden-dowel telescope mount for a spin, and got pictures of Jupiter and Saturn with my high-power eyepiece! "}},{"type":"markdown","markdown":{"content":"I took many pictures, and a few videos. I also figured out how to control the shutter speed on my phone's camera, and got many photos at 1/40s shutter speed. Using a smaller shutter speed takes the planets from blinding white blurs to circular colored blurs, I assume because it lets in less light. It can make a planet go from blindingly white to almost completely disappearing into the night sky. However, my phone doesn't let me control those settings when taking a video. The second and third images show the best raw pictures I got. "}},{"type":"markdown","markdown":{"content":"Saturn through my telescope had this weird diagonal smear to it. Since I've been fighting vibration issues with my wooden-dowel mount, I think it's a very small high-frequency vibration from left to right causing that problem?"}},{"type":"markdown","markdown":{"content":"Then I tried using image processing software, Pipp plus autostakkert plus registrax, following [this video tutorial](https://youtu.be/zQYbtzsnQ3E). There were some shenanigans because Pipp's site got taken down and I had to find a backup, but eventually I made the heavily processed Jupiter in the first image. Sadly, I haven't figured out how to stack my photos because the software complained my images were different sizes (from before and after I pressed the \"save as raw\" button), but I was able to take a video of Jupiter without the high shutter speed setting and process that. It was a bit underwhelming - I went from dim blurry sphere to SLIGHTLY STRIPED dim blurry sphere! Wow! If there's one thing I learned I suppose it's that my telescope was out of focus."}},{"type":"markdown","markdown":{"content":"I hope the pictures will be improved if I make a new mount using metal EMT pipes."}}],"pinned":false,"commentsLocked":false,"sharesLocked":false,"singlePostPageUrl":"https://cohost.org/hillexed/post/2127715-gas-giants-wooden-w"}