{"postId":4062839,"headline":"Observing amongst the salt thieves","publishedAt":"2024-01-03T04:30:22.285Z","state":1,"cws":[],"tags":["astronomy","space"],"blocks":[{"type":"attachment","attachment":{"kind":"image","fileURL":"https://staging.cohostcdn.org/attachment/9661d7fd-7a62-4a49-b035-9bbc7279c892/IMG_20240102_224541703_1.jpg","previewURL":"https://staging.cohostcdn.org/attachment/9661d7fd-7a62-4a49-b035-9bbc7279c892/IMG_20240102_224541703_1.jpg","attachmentId":"9661d7fd-7a62-4a49-b035-9bbc7279c892","altText":"","width":1200,"height":900}},{"type":"markdown","markdown":{"content":"I drove out to what Google maps said was a park and then saw a sign saying \"state property no trespassing\" and a second sign saying \"don't steal road salt or gravel from here, if we catch you you'll be prosecuted\". I guess that's what some silly rural fellows get up to in their free time?\nSo I parked right in front of the entrance off the side of the road, since it was pretty dark.\nEventually someone did drive up in a truck and ask if I was lost before driving in and then out a few minutes later (to I imagine check for salt thieves)!"}},{"type":"markdown","markdown":{"content":"Astronomy: it was so dark.  I could see mountains and trees silhouetted against the sky once my dark vision adapted. I could see a naked eye slight fuzzy patch, point my scope, and it was M44! Lots of stars in one place.  Everything had a slight bloom to it, like the sky some haze, and eventually a high cloud came in and reduced visibility to \"only\" a bortle 6 or so. Wow."}},{"type":"markdown","markdown":{"content":"I also saw a dim fuzzy near Auriga - maybe M37? Pleiades looked as good as ever. Jupiter had four nice moons."}},{"type":"markdown","markdown":{"content":"The pifinder didn't get a GPS lock, and then shut down from lack of battery pretty quickly. I think the battery pack might be having more issues from when the scope fell off the mount a week ago?"}}],"pinned":false,"commentsLocked":false,"sharesLocked":false,"singlePostPageUrl":"https://cohost.org/hillexed/post/4062839-observing-amongst-th"}